--=============================================================================--
-- @作者: 白狐剑仙。
-- @邮箱: 1733450036@qq.com
-- @创建时间:   2017-08-01 12:45:25
-- @最后修改来自: 白狐剑仙。
-- @Last Modified time: 2017-11-14 13:18:53
--=============================================================================--
系统类  = class()
--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 系统类:初始化()
end
--=============================================================================--
-- ■ 系统:增加怪物
--=============================================================================--
function 系统类:增加怪物(怪物类型,坐标x,坐标y,怪物类别,重命名)

	local 临时怪物  = {}
	重命名1=重命名

	if ( 怪物类型 == "哥布林") then
		临时怪物 = 怪物_哥布林.创建(坐标x,坐标y,table.getn(Q_屏幕怪物组) + 1,引擎.取随机整数(4,4),怪物类别,重命名1)
	--elseif ( 怪物类型 == "投掷哥布林") then
		--临时怪物 = 怪物_投掷哥布林.创建(坐标x,坐标y,table.getn(Q_屏幕怪物组) + 1,引擎:取随机整数(1,4),怪物类别,重命名1)
	--elseif ( 怪物类型 == "牛头兵") then
		--临时怪物 = 怪物_牛头兵.创建(坐标x,坐标y,table.getn(Q_屏幕怪物组) + 1,引擎:取随机整数(4,4),怪物类别,重命名1)
	end
	table.insert(Q_屏幕怪物组,临时怪物)
	加入屏幕物件组(临时怪物)

end

--=============================================================================--
-- ■ 系统:单帧特效()
--=============================================================================--
function 系统类:单帧特效(特效名称,x,y,min,max,中间值,层次,翻转)

	for n=1,table.getn(Q_游戏单帧特效组) do
		if ( Q_游戏单帧特效组[n].名称 == 特效名称 ) then

			local 临时特效 = 特效_单帧渐隐.创建(Q_游戏单帧特效组[n].图片文件,x,y,min,max,中间值,Q_游戏单帧特效组[n].Y偏移,Q_游戏单帧特效组[n].混合,翻转)

			if (层次==0) then
				table.insert(Q_屏幕特效组,临时特效)
				加入屏幕物件组(临时特效)
			else
				table.insert(Q_地图.特效_最顶层,临时特效)
			end
			return  临时特效
		end
	end
end

--=============================================================================--
-- ■ 系统:显示特效()
--=============================================================================--
function 系统类:显示特效(管理器,特效名称,x,y,显示次数,特效类型,方向,缩放,弧度)

	for n=1,table.getn(Q_游戏特效组) do
		if ( Q_游戏特效组[n].名称 == 特效名称 ) then
			local 临时特效 = 特效类.创建(管理器,特效类型,x,y,显示次数,Q_游戏特效组[n].中心点x,Q_游戏特效组[n].中心点y,
												Q_游戏特效组[n].开始帧,Q_游戏特效组[n].结束帧,Q_游戏特效组[n].帧率,Q_游戏特效组[n].混合,Q_游戏特效组[n].颜色值,Q_游戏特效组[n].Y偏移)
			临时特效.方向 = 方向
			临时特效.缩放 = 缩放
			if (弧度~=nil)then
				临时特效.弧度 = 弧度
			end
			table.insert(Q_屏幕特效组,临时特效)
			加入屏幕物件组(临时特效)
			return  临时特效
		end
	end

end

--=============================================================================--
-- ■ 系统:显示地图物品特效()
--=============================================================================--
function 系统类:显示MOBJ特效(管理器,特效名称,x,y,显示次数,特效类型,方向,缩放,弧度,是否移动,显示w ,显示h,显示方向)

	for n=1,table.getn(Q_游戏MOBJ特效组) do
		if (Q_游戏MOBJ特效组[n].名称 == 特效名称 ) then

			local 临时特效 = 特效类.创建(管理器,特效类型,x,y,显示次数,Q_游戏MOBJ特效组[n].中心点x,Q_游戏MOBJ特效组[n].中心点y,
			Q_游戏MOBJ特效组[n].开始帧,Q_游戏MOBJ特效组[n].结束帧,Q_游戏MOBJ特效组[n].帧率,Q_游戏MOBJ特效组[n].混合,Q_游戏MOBJ特效组[n].颜色值,Q_游戏MOBJ特效组[n].Y偏移,是否移动,显示w ,显示h,显示方向)

			临时特效.方向 = 方向
			临时特效.缩放 = 缩放
			if (弧度~=nil)then
				临时特效.弧度 = 弧度
			end
			table.insert(Q_屏幕特效组,临时特效)
			加入屏幕物件组(临时特效)
			return  临时特效
		end
	end

end
--=============================================================================--
-- ■ 系统:显示属性打击特效()
--=============================================================================--
function 系统类:显示AS特效(管理器,特效名称,x,y,显示次数,特效类型,方向,缩放,弧度)

	for n=1,table.getn(Q_游戏AS特效组) do
		if (Q_游戏AS特效组[n].名称 == 特效名称 ) then

			local 临时特效 = 特效类.创建(管理器,特效类型,x,y,显示次数,Q_游戏AS特效组[n].中心点x,Q_游戏AS特效组[n].中心点y,
			Q_游戏AS特效组[n].开始帧,Q_游戏AS特效组[n].结束帧,Q_游戏AS特效组[n].帧率,Q_游戏AS特效组[n].混合,Q_游戏AS特效组[n].颜色值,Q_游戏AS特效组[n].Y偏移)

			临时特效.方向 = 方向
			临时特效.缩放 = 缩放
			if (弧度~=nil)then
				临时特效.弧度 = 弧度
			end
			table.insert(Q_屏幕特效组,临时特效)
			加入屏幕物件组(临时特效)
			return  临时特效
		end
	end

end
--=============================================================================--
-- ■ 系统:跳转地图()
--=============================================================================--
function 系统类:跳转地图(地图名称, x, y, 方向)

	Q_地图:销毁()
	Q_主角.坐标.x = x
	Q_主角.坐标.y = y
	Q_主角.方向 = 方向
	Q_地图:加载地图(地图名称)

end
