--=============================================================================--
-- @作者: 白狐剑仙。
-- @邮箱: 1733450036@qq.com
-- @创建时间:   2017-08-01 12:45:25
-- @最后修改来自: 白狐剑仙。
-- @Last Modified time: 2017-10-21 17:32:12
--=============================================================================--
鼠标类  = class()
--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 鼠标类:初始化()

	self.普通精灵= require ("gge精灵类") (Q_目录.. [[\Dat\UI\通用cur\普通.png]],0,0,32,32)

	self.按下精灵= require ("gge精灵类") (Q_目录..[[\Dat\UI\通用cur\按下.png]],0,0,31,31)

	self.出售动画= require ("gge动画类") (Q_目录..[[\Dat\UI\通用cur\出售.png]],4,6,39,29,0,0)
	self.出售动画:播放()

	self.购买动画 = require ("gge动画类") (Q_目录..[[\Dat\UI\通用cur\购买.png]],4,6,39,29,0,0)
	self.购买动画:播放()

	self.分解动画 = require ("gge动画类") (Q_目录..[[\Dat\UI\通用cur\分解.png]],4,6,39,29,0,0)
	self.分解动画:播放()

	self.对话动画= require ("gge动画类") (Q_目录..[[\Dat\UI\通用cur\NPC对话.png]],4,6,27,23,0,0)
	self.对话动画:播放()

	self.模式 = "普通"

end

--=============================================================================--
-- ■ 更新
--=============================================================================--
function 鼠标类:更新()

	if (self.模式 == "对话") then
		self.对话动画:更新(dt)
	end

	if (self.模式 == "购买") then
		self.购买动画:更新(dt)
	end

	if (self.模式 == "出售") then
		self.出售动画:更新(dt)
	end

	if (self.模式 == "分解") then
		self.分解动画:更新(dt)
	end

	if (引擎.鼠标按住(键_鼠标左)) then
		if (Q_游戏鼠标.模式 ~= "出售" and Q_游戏鼠标.模式 ~= "购买" and Q_游戏鼠标.模式 ~= "分解") then
			self.模式 = "按下"
		end
	end

end

--=============================================================================--
-- ■ 显示
--=============================================================================--
function 鼠标类:显示()

	if (self.模式 == "普通") then
		self.普通精灵:显示(Q_鼠标坐标.x,Q_鼠标坐标.y)
	elseif (self.模式 == "按下") then
		self.按下精灵:显示(Q_鼠标坐标.x,Q_鼠标坐标.y)
	elseif (self.模式 == "对话") then
		self.对话动画:显示(Q_鼠标坐标.x,Q_鼠标坐标.y)
	elseif (self.模式 == "出售") then
		self.出售动画:显示(Q_鼠标坐标.x,Q_鼠标坐标.y)
	elseif (self.模式 == "购买") then
		self.购买动画:显示(Q_鼠标坐标.x,Q_鼠标坐标.y)
	elseif (self.模式 == "分解") then
		self.分解动画:显示(Q_鼠标坐标.x,Q_鼠标坐标.y)

	end

end
