--=============================================================================--
-- @作者: 白狐剑仙。
-- @邮箱: 1733450036@qq.com
-- @创建时间:   2017-08-01 12:45:25
-- @最后修改来自: 白狐剑仙。
-- @Last Modified time: 2017-11-18 00:17:41
--=============================================================================--


---=============================================================================--
-- ■ 加入屏幕物件组()
--=============================================================================--
function 加入屏幕物件组(物件)

	物件.物件ID = table.maxn (Q_屏幕物件组) + 1   -- __n存放着该对象 在Q_屏幕物件组的位置.
	table.insert(Q_屏幕物件组,物件)

end
--=============================================================================--
-- ■ 减少道具()
--=============================================================================--
function 减少道具(道具格子)

	if (道具格子.道具.数量 > 1) then
		道具格子.道具.数量 = 道具格子.道具.数量 - 1
	else
		道具格子.道具.id = 0
	end
end
--=============================================================================--
-- ■ CD时间变更()
--=============================================================================--
function CD时间变更(道具)

	道具格子=道具

	if (道具.分类 == "药剂" ) then
		Q_全局CD.HP_延时时间 = Q_游戏道具组[道具格子.道具.id].武器物理技能MP  -- CD时间
		Q_全局CD.HP_延时参考 = 0
		Q_全局CD.HP_延时进度 = 0

	elseif (Q_游戏道具组[道具格子.道具.id].子类 == "MP" ) then
		Q_全局CD.MP_延时时间 = Q_游戏道具组[道具格子.道具.id].武器物理技能MP  -- CD时间
		Q_全局CD.MP_延时参考 = 0
		Q_全局CD.MP_延时进度 = 0
	elseif (Q_游戏道具组[道具格子.道具.id].子类 == "HP" ) then
		Q_全局CD.HP_延时时间 = Q_游戏道具组[道具格子.道具.id].武器物理技能MP  -- CD时间
		Q_全局CD.HP_延时参考 = 0
		Q_全局CD.HP_延时进度 = 0
	end

end

