--=============================================================================--
-- @作者: 白狐剑仙。
-- @邮箱: 1733450036@qq.com
-- @创建时间:   2017-08-01 12:45:25
-- @最后修改来自: 白狐剑仙。
-- @Last Modified time: 2017-11-22 00:07:26
--=============================================================================--
Q_地图脚本组 = {}

Q_地图脚本组["赛利亚旅馆"] = {
	Main =   function ()
				Q_地图配置 = {类型 = "区",标识 = "赛利亚旅馆",名称 = "赛利亚旅馆",地面 = "",阴影 = "灯光",音乐 = "赛利亚房间.ogg",音量 = 70}
				Q_地图.地图_事件箱[1] = {x=375,y=540,w=210,h=20,map="艾尔文防线",map_x=794,map_y=364}
				--Q_系统:显示NPC("家_赛丽亚",480,355,1,1)
				--Q_系统:显示NPC("邮件_邮箱",687,380,1,1)
				--Q_系统:单帧特效("家_镭射灯光",143,0,100,250,1,0)
				--Q_系统:单帧特效("家_出口灯光",373,426,0,255,4,1)
				--Q_系统:单帧特效("家_灯台灯光",330,430,0,255,4,1)
			end
}

Q_地图脚本组["艾尔文防线"] = {
	Main =   function ()
				Q_地图配置 = {类型 = "区",名称 = "艾尔文防线",地面 = "草地",阴影 = "阳光",音乐 = "艾尔文防线.ogg",音量 = 80}
				Q_地图.地图_事件箱[1] = {x=758,y=310,w=80,h=40,map="赛利亚旅馆",map_x=485,map_y=520}
				Q_地图.地图_事件箱[2] = {x=1697,y=377,w=40,h=240,map="艾尔文防线_B",map_x=32,map_y=475}
				--Q_系统:显示NPC("铁匠_林纳斯",475,382,1)
				--Q_系统:显示NPC("艾尔文防线_土罐", 1400, 380, -1,1)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"铁匠火炉",400,385,0,"普通",1,1)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"铁匠招牌", 518, 375, 0, "普通", 1, 1)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"传送门特效", 755, 210, 0, "普通", 1, 1)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"星星光效", 755, 210, 0, "普通", 1, 1)
				--Q_系统:单帧特效("阿法利亚入口门点_大", 1132, 447, 0,255, 4, 1)

				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"地图_光照4", 175, 0, 0, "地图光照2", 1, 1,0,true,1,1,0)--X坐标，Y坐标，显示次数，类型，方向，缩放，弧度，是否移动，显示W，显示H，旋转角度
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"地图_光照5", 265, 0, 0, "地图光照2", 1, 1,0,true,1,0.5,-0.32)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"地图_光照3", 275, 0, 0, "地图光照1", 1, 1,0,true,1,1,0)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"地图_光照4", 395, 0, 0, "地图光照2", 1, 1,0,true,1,0.6,-0.25)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"地图_光照3", 485, 0, 0, "地图光照1", 1, 1,0,true,1,0.75,-0.1)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"地图_光照3", 805, 0, 0, "地图光照1", 1, 1,0,true,1,0.75,-0.1)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"地图_光照4", 995, 0, 0, "地图光照1", 1, 1,0,true,1,0.75,-0.1)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"地图_光照5", 1095, 0, 0, "地图光照1", 1, 1,0,true,1,0.75,-0.1)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"地图_光照3", 1295, 0, 0, "地图光照1", 1, 1,0,true,1,0.75,-0.1)

				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"树叶_投影3", 2, 378, 0, "地图光照1", 1,1,0,true,1,1,0)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"树叶_投影3", 597, 376, 0, "地图光照1", 1,1,0,true,1,1,0)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"树叶_投影3", 217, 376, 0, "地图光照1", 1,1,0,true,1,1,0)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"树叶_投影3", 997, 372, 0, "地图光照1", 1,1,0,true,1,1,0)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"树叶_投影3", 1369, 372, 0, "地图光照1", 1,1,0,true,1,1,0)

			end
}


Q_地图脚本组["艾尔文防线_B"] = {
	Main =   function ()
				Q_地图配置 = {类型 = "区",标识 = "艾尔文防线入口",名称 = "艾尔文防线入口",地面 = "草地",阴影 = "阳光",音乐 = "艾尔文防线.ogg",音量 = 70}
				Q_地图.地图_事件箱[1] = {x=1,y=390,w=10,h=160,map="艾尔文防线",map_x=1687,map_y=450}
				--Q_地图.地图_事件箱[2] = {x=884,y=390,w=10,h=160,map="艾尔文关卡",map_x=880,map_y=475}
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"树叶_投影3", 0, 378, 0, "地图光照1", 1,1,0,true,1,1,0)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"树叶_投影3", 405, 378, 0, "地图光照1", 1,1,0,true,1,1,0)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"树叶_投影3", 750, 378, 0, "地图光照1", 1,1,0,true,0.8,1,0)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"地图_光照5", 265, 0, 0, "地图光照2", 1, 1,0,true,1,0.5,-0.32)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"地图_光照3", 275, 0, 0, "地图光照1", 1, 1,0,true,1,0.65,-0.2)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"地图_光照4", 395, 0, 0, "地图光照2", 1, 1,0,true,1,0.6,-0.25)
				Q_系统:显示MOBJ特效(Q_地图_动画_管理器,"地图_光照3", 485, 0, 0, "地图光照1", 1, 1,0,true,1,0.5,-0.3)
			end
}

Q_地图脚本组["洛兰_D"] = {
	Main =   function ()
				Q_地图配置 = {类型 = "地下城",名称 = "洛兰",地面 = "草地",阴影 = "阳光",音乐 = "洛兰.ogg",音量 = 60}
				--Q_系统:增加怪物("哥布林",620,382,1)
				--Q_系统:增加怪物("哥布林",539,525,1)
				--Q_系统:增加怪物("哥布林",866,495,1)
				--Q_系统:增加怪物("哥布林",930,389,1)
				--Q_系统:增加怪物("哥布林",708,503,1)--]]
				--Q_系统:增加门点("洛兰左",110,225,200,1,-1)
				Q_地图.地图_事件箱[1] = {x=50,y=405,w=20,h=45,map="洛兰_C",map_x=1153,map_y=410}
				--Q_系统:增加门点("洛兰下BOSS",805,475,100,1)
				Q_地图.地图_事件箱[2] = {x=858,y=555,w=90,h=30,map="洛兰_BOSS",map_x=335,map_y=378}
			end
}