--=============================================================================--
-- @作者: 白狐剑仙。
-- @邮箱: 1733450036@qq.com
-- @创建时间:   2017-08-01 12:45:25
-- @最后修改来自: 白狐剑仙。
-- @Last Modified time: 2017-11-16 23:33:33
--=============================================================================--
Q_物品脚本组 = {}

Q_物品脚本组["赛利亚的新手HP药剂"] = {

	Main =   function ()
		if (Q_全局CD.HP_延时时间 > 0) then
			return
		end
		if (Q_主角.状态 ~= "死亡" and Q_主角.角色属性.HP < Q_主角.角色属性.MAX_HP) then
			Q_主角.角色属性.HP = Q_主角.角色属性.HP + 40
			if (Q_主角.角色属性.MAX_HP < Q_主角.角色属性.HP) then
				Q_主角.角色属性.HP = Q_主角.角色属性.MAX_HP
			end
			Q_全局音效.HP增加音效:播放()
			CD时间变更(Q_最后使用道具格子)
			减少道具(Q_最后使用道具格子)
			Q_系统:显示MOBJ特效(Q_屏幕_特效_管理器,"吃HP效果",-1,-1,1,"主角中心跟随",1,1)
		end
	end
}

Q_物品脚本组["赛利亚的新手MP药剂"] = {

	Main =   function ()
		if (Q_全局CD.MP_延时时间 > 0) then
			return
		end
		if (Q_主角.状态 ~= "死亡" and Q_主角.角色属性.MP < Q_主角.角色属性.MAX_MP) then
			Q_主角.角色属性.MP = Q_主角.角色属性.MP + 40
			if (Q_主角.角色属性.MAX_MP < Q_主角.角色属性.MP) then
				Q_主角.角色属性.MP = Q_主角.角色属性.MAX_MP
			end
			Q_全局音效.MP增加音效:播放()
			CD时间变更(Q_最后使用道具格子)
			减少道具(Q_最后使用道具格子)
			Q_系统:显示MOBJ特效(Q_屏幕_特效_管理器,"吃MP效果",-1,-1,1,"主角中心跟随",1,1)
		end
	end
}
