--=============================================================================--
-- @作者: 白狐剑仙。
-- @邮箱: 1733450036@qq.com
-- @创建时间:   2017-08-01 12:45:25
-- @最后修改来自: 白狐剑仙。
-- @Last Modified time: 2017-11-18 00:06:40
-- ★ 精灵文字扩展类
--=============================================================================--
扩展_精灵文字A  = class()
--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 扩展_精灵文字A:初始化()
	self.序列_图片 = {}
	self.序列_精灵 = {}

	for n=1,10 do
		self.序列_图片 [n] = require("gge纹理类")(Q_目录..[[/Dat/attacknum/B/]] .. tostring(n-1) .. [[.png]])
		self.序列_精灵 [n] = require("gge精灵类")(self.序列_图片 [n],0,0,self.序列_图片 [n]:取宽度(),self.序列_图片 [n]:取高度())
	end

end

--=============================================================================--
-- ■ 显示
--=============================================================================--
function 扩展_精灵文字A:显示(数值,x,y,每数字宽度,每数字高度,透明度,是否为红色)

	self.显示文本 = tostring(数值)

	self.文本长度 = string.len(self.显示文本)

	for n=1, self.文本长度 do

		local  本次 = tonumber(self:取文本单字符(self.显示文本,n,1)) + 1

		if (是否为红色) then
			self.序列_精灵 [本次]:置颜色 (ARGB (透明度, 255, 0, 0))
		else
			self.序列_精灵 [本次]:置颜色 (ARGB (透明度, 255,255,0))
		end

		self.序列_精灵 [本次]:置坐标_高级(取整((n-1)*(每数字宽度-2)+x),取整(y),0,每数字宽度/self.序列_精灵 [本次]:取宽度(),每数字高度/self.序列_精灵 [本次]:取高度())
		self.序列_精灵 [本次]:显示()

	end

end

--=============================================================================--
--■ 取文本中间 ()
--=============================================================================--
function 扩展_精灵文字A:取文本单字符(文本,开始长度,取出长度)

    local s = string.sub(文本,开始长度, 开始长度)

    return s
end
--=============================================================================--
-- ■ 销毁
--=============================================================================--
function 扩展_精灵文字A:销毁()

	for n=1,10 do
		--引擎:销毁图片(self.序列_图片 [n] )
		self.序列_精灵[n]:销毁()
	end

end
