--=============================================================================--
-- @作者: 白狐剑仙。
-- @邮箱: 1733450036@qq.com
-- @创建时间:   2017-08-01 12:45:25
-- @最后修改来自: 白狐剑仙。
-- @Last Modified time: 2017-11-22 15:20:39
--=============================================================================--
扩展_三层按钮 = class()
--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 扩展_三层按钮:初始化(按钮名目录,x坐标,y坐标,类型,提示内容)

	self.类型 = 类型

	self.普通图片 = require ("gge纹理类")(按钮名目录 .. "1.png")
	self.点燃图片 = require ("gge纹理类")(按钮名目录 .. "2.png")
	self.按下图片 = require ("gge纹理类")(按钮名目录 .. "3.png")

	self.音效 = nil

	self.按钮名称 = 按钮名称
	self.显示偏移 = {x=0,y=0}

	self.普通精灵 = require ("gge精灵类")(self.普通图片,0,0,self.普通图片:取宽度(),self.普通图片:取高度())
	self.点燃精灵 = require ("gge精灵类")(self.点燃图片,0,0,self.点燃图片:取宽度(),self.点燃图片:取高度())
	self.按下精灵 = require ("gge精灵类")(self.按下图片,0,0,self.按下图片:取宽度(),self.按下图片:取高度())

	if(self.类型 == "选择角色") then
		self.选中图片 = require ("gge纹理类")(按钮名目录 .. "4.png")
		self.选中精灵 = require ("gge精灵类")(self.选中图片,0,0,self.选中图片:取宽度(),self.选中图片:取高度())
	end

	self.显示坐标 = {x=x坐标,y=y坐标}
	self.状态 = 1   ---- 1正常, 2点燃, 3按下,4灰色

	self.包围盒 = require ("gge包围盒")(x坐标,y坐标,self.点燃图片:取宽度(),self.点燃图片:取高度())

	self.提示 = false

	self.风格提示= {原始内容 = "" ,风格文字组 = {},宽度 = 0,高度 = 0}

	if( 提示内容 ~= nil )then
		if(self.类型 == "文字按钮") then
			self.文字标题 = 提示内容
		else
			self.提示 = true
			self.风格提示.原始内容 = 提示内容
			self.风格提示.风格文字组, self.风格提示.宽度 , self.风格提示.高度 = 格式化文字 (文字,self.风格提示.原始内容,5)
		end

	end

	self.激活= false
	self.透明度 = 245
	self.透明中间值 = 5

end

---=============================================================================--
-- ■ 更新()
--=============================================================================--
function 扩展_三层按钮:更新()

	self.是否单击 = false

	if(self.包围盒:检查点(Q_鼠标坐标.x,Q_鼠标坐标.y)) then

		if(引擎.鼠标按下(键_鼠标左))then
			self.激活 = true
		end

		if(引擎.鼠标按住(键_鼠标左) ) then

			if (self.激活) then
				self.状态 = 3
			else
				self.状态 = 2
			end

		else

			if(self.状态 ~= 2 and self.状态~=3 and self.状态~=4) then
				if (self.音效 ~=nil) then
					self.音效:播放()
				end
			end

			if (self.状态~=4) then
				self.状态 = 2
			end

		end

		if(引擎.鼠标弹起(键_鼠标左)) then

			self.是否单击 = true
			if (self.类型 == "选择角色")  then
				self.状态 = 4
			end

		end

      else

		if (self.类型 == "选择角色" and self.状态 == 4)  then

		else
		     self.状态 = 1
		     self.激活 = false

		end

	end

	if(self.包围盒:检查点(Q_鼠标坐标.x,Q_鼠标坐标.y) == false) then
		if (self.状态 ~= 4) then
			self.状态 = 1
		end
	end

	if(self.状态 == 2 or self.状态 == 3) then

		if ( self.提示 ) then

			Q_屏幕.最顶气泡显示 = true
			Q_屏幕.风格提示.风格文字组 = self.风格提示.风格文字组
			Q_屏幕.风格提示.宽度 = self.风格提示.宽度
			Q_屏幕.风格提示.高度 = self.风格提示.高度
			Q_屏幕.风格提示.x = self.显示坐标.x + self.显示偏移.x
			Q_屏幕.风格提示.y = self.显示坐标.y + self.显示偏移.y

		end

	end

	if (self.类型 == "自动闪烁" )  then
		self.透明度 = self.透明度 + self.透明中间值

		if ( self.透明度  == 255 or self.透明度  == 145) then
			self.透明中间值 = -self.透明中间值
		end
		self.普通精灵:置颜色( ARGB(self.透明度,255,255,255) )
		self.普通精灵:置混合模式(混合_颜色乘)
	end

end

---=============================================================================--
-- ■ 显示()
--=============================================================================--
function 扩展_三层按钮:显示()

	if(self.状态 == 1) then
		self.普通精灵:显示(self.显示坐标.x,self.显示坐标.y)
	elseif(self.状态 == 2) then
		self.点燃精灵:显示(self.显示坐标.x,self.显示坐标.y)
	elseif(self.状态 == 3) then
		self.按下精灵:显示(self.显示坐标.x,self.显示坐标.y)
	elseif(self.状态 == 4) then
		self.选中精灵:显示(self.显示坐标.x,self.显示坐标.y)

	end

	if(self.类型 == "文字按钮") then
		if(self.状态 == 1) then
			文字_描边显示(文字,self.显示坐标.x + 15,self.显示坐标.y+6,self.文字标题,-2243187,颜色_黑)
		elseif(self.状态 == 2) then
			文字_描边显示(文字,self.显示坐标.x + 15,self.显示坐标.y+6,self.文字标题,-196659,颜色_黑)
		elseif(self.状态 == 3) then
			文字_描边显示(文字,self.显示坐标.x + 15,self.显示坐标.y+7,self.文字标题,-196659,颜色_黑)
		end
	end


	if (Q_调试) then
		self.包围盒:显示()
	end

end

--=============================================================================--
-- ■ 置状态()     1正常, 2点燃, 3按下
--=============================================================================--
function 扩展_三层按钮:置状态(状态)
	self.状态 = 状态
end

--=============================================================================--
-- ■ 取是否单击()
--=============================================================================--
function 扩展_三层按钮:取是否单击()

	if (self.是否单击 and self.激活) then
		self.激活 = false
		return true
	end

	return false

end

--=============================================================================--
-- ■ 置位置()
--=============================================================================--
function 扩展_三层按钮:置位置(x坐标,y坐标)

	self.显示坐标.x  =  x坐标
	self.显示坐标.y  =  y坐标
	self.包围盒:置坐标(x坐标,y坐标)

end

--=============================================================================--
-- ■ 是否有焦点()
--=============================================================================--
function 扩展_三层按钮:是否有焦点()
	return self.包围盒:检查点(Q_鼠标坐标.x,Q_鼠标坐标.y)
end

--=============================================================================--
-- ■ 销毁()
--=============================================================================--
function 扩展_三层按钮:销毁()

    self.普通图片:释放()
    self.点燃图片:释放()
    self.按下图片:释放()

    self.普通精灵:释放()
	self.点燃精灵:释放()
	self.按下精灵:释放()

end