--=============================================================================--
-- @作者: 白狐剑仙。
-- @邮箱: 1733450036@qq.com
-- @创建时间:   2017-08-01 12:45:25
-- @最后修改来自: 白狐剑仙。
-- @Last Modified time: 2017-08-01 23:26:21
--=============================================================================--
扩展_地图物件  = class()
--=============================================================================--
-- ■ 构造函数
--=============================================================================--
function 扩展_地图物件:初始化(物件信息,图片地址,id)

	self.标识类型 = "地图物件"
	self.物件精灵 = require ("gge精灵类") (图片地址,0 ,0 ,图片地址:取宽度(),图片地址:取高度())
	self.物件精灵:置中心(取整_( 图片地址:取宽度()/2 ), 取整_(图片地址:取高度()/2))


	self.翻转 = 物件信息.翻转

	self.坐标 = {x=物件信息.显示x, y=物件信息.显示y}

	self.中心点偏移 = {x=物件信息.中心点偏移_x,y=物件信息.中心点偏移_y}
	self.参照点 = {x=物件信息.中心点_x,y=物件信息.中心点_y}
	self.id = id


	self.参照点.x = self.坐标.x + self.中心点偏移.x
	self.参照点.y = self.坐标.y + self.中心点偏移.y
	self.地平线 = self.参照点.y

	if (物件信息.自动透明 == 1) then
		self.是否透明动画 = true
	else
		self.是否透明动画 = false
	end

	self.当前透明度 =   255

end

--=============================================================================--
-- ■ 更新
--=============================================================================--
function 扩展_地图物件:更新()

	--self.地平线 = self.参照点.y

	if (self.是否透明动画) then

		if (Q_主角.地平线 < self.地平线 and self.物件精灵:取包围盒():检查点 (Q_主角.坐标.x+ Q_画面偏移.x,Q_主角.地平线 )) then

			if (self.当前透明度 > 150) then
				self.当前透明度 = self.当前透明度 - 10
				self.物件精灵:置颜色 (ARGB (self.当前透明度, 255, 255, 255))

			end

		else
			if (self.当前透明度 ~= 255) then
				self.当前透明度 = self.当前透明度 + 10
			end
			self.物件精灵:置颜色 (ARGB (self.当前透明度, 255, 255, 255))
		end

	end

end

--=============================================================================--
-- ■ 显示
--=============================================================================--
function 扩展_地图物件:显示()

	self.参照点.x = self.坐标.x + self.中心点偏移.x
	self.参照点.y = self.坐标.y + self.中心点偏移.y

	self.物件精灵:置坐标(self.坐标.x+ Q_画面偏移.x,self.坐标.y+ Q_画面偏移.y)
	self.物件精灵:置坐标_高级(self.坐标.x+ Q_画面偏移.x,self.坐标.y+ Q_画面偏移.y,0,self.翻转,1)
	self.物件精灵:显示()

	if (Q_调试) then
		--引擎.画矩形(self.参照点.x+ Q_画面偏移.x ,self.参照点.y+ Q_画面偏移.y, 5,50,颜色_红)
		self.物件精灵:取包围盒():显示(黄)
	end

end

--=============================================================================--
-- ■ 销毁
--=============================================================================--
function 扩展_地图物件:销毁()

	self.物件精灵:释放()

end